[
 {
   "name": "Xochitl",
   "region": "Pride",
   "element": "Ether",
   "bio":"A newbie demon hunter who moved to Superbia for a better life. She doesn't have any goals for the future and treats demon hunting as simply a side hustle.",
   "image": "images/char/xochitl.png"
 },
 {
   "name": "Glitch",
   "region": "Pride",
   "element": "Electric",
   "bio":"A prodigy demon hunter living in the Superbia. He has skills in creating technology capable of controlling demons.",
   "image": "images/char/glitch.png"
 },
 {
   "name": "Hana",
   "region": "Gluttony",
   "element": "Terra",
   "bio":"A young shrine maiden working at the shrines overseeing the monthly tributes. Her responsibilities include ensuring the tributes’ 'cleanliness' before each full moon.",
   "image": "images/char/hana.png"
 },
 {
   "name": "Akito",
   "region": "Gluttony",
   "element": "Ice",
   "bio":"A courier who practices archery to send messages to people in the region. He secretly wants to dismantle the tribute system and rebel against the demons.",
   "image": "images/char/akito.png"
 },
 {
   "name": "Freesia",
   "region": "Sloth",
   "element": "Wind",
   "bio":"A childish girl with a love for fashion. She like pranking her friends but acts obedient around strangers.",
   "image": "images/char/freesia.png"
 },
 {
   "name": "Dash",
   "region": "Sloth",
   "element": "Ether",
   "bio":"A boy bred with rabbit ears. Energetic and tends to run off often, much to the dismay of his guardian demon.",
   "image": "images/char/dash.png"
 },
 {
   "name": "Linnea",
   "region": "Envy",
   "element": "Ice",
   "bio":"A girl with a shaman lineage. She is proud to be descendant of the first chief of the natives.",
   "image": "images/char/linnea.png"
 },
 {
   "name": "Kai",
   "region": "Envy",
   "element": "Fire",
   "bio":"A shy boy who isn’t confident in his skills. He likes taking care of wild animals living in his region.",
   "image": "images/char/kai.png"
 },
 {
   "name": "Odin",
   "region": "Wrath",
   "element": "Terra",
   "bio":"Contrary to the hostile environment of the region of Ira, he takes care of children who lost their homes from the demons.",
   "image": "images/char/odin.png"
 },
 {
   "name": "Lime",
   "region": "Wrath",
   "element": "Electric",
   "bio":"A short-tempered, idealistic girl who strives to be the strongest. She has an infamous reputation among the locals.",
   "image": "images/char/lime.png"
 },
 {
   "name": "Epsilon",
   "region": "Lust",
   "element": "Ether",
   "bio":"A half demon-half human professor studying the supernatural and is well respected among his students.",
   "image": "images/char/epsilon.png"
 },
 {
   "name": "Rose",
   "region": "Lust",
   "element": "Fire",
   "bio":"A witch who is extremely devout to demons to the point of blind worship.",
   "image": "images/char/rose.png"
 }
 ]

